lang = dict()

cht = dict()

cht['help_villager'] = u'你是村民，要把人狼揪出來吊死。你沒有特殊能力，用勇氣與智慧拯救村子吧！'
cht['help_wolf'] = u'你是人狼，白天混在村民之中，與常人無異，夜幕低垂時，與狼群同伴密謀殺害村民。'
cht['help_seer'] = u'你是占卜師，村民的希望。每個夜晚，透過神秘的儀式，探知一位村民的真實身份。'
cht['help_healer'] = u'你是醫者，村民的希望。每個夜晚，用回春妙手，治療一位村民所受的傷害，人狼的攻擊也殺他不死，但你無法治療自己！'
cht['help_blocker'] = u'你是魅魔，人狼的同夥。每個夜晚，你用邪惡的力量，迷惑一位村民，使其無法發揮能力。'
cht['help_possession'] = u'你是附身的邪靈，人狼的同夥。外表與村民無異，也無特殊能力。因為宿主的精神干擾，無法與人狼溝通。'

cht['sys_voteready'] = u'請用滑鼠點擊任何使用者，投票以開始進行遊戲。'
cht['sys_welcome'] = u'歡迎來到<b>%s</b>，這是一個沒有暴力、溫馨的地方。'
cht['sys_sunrise'] = (u'天亮了，早起的蟲兒有鳥吃。', u'公雞啼，洨鳥叫，太陽出來了。', u'藍天藍，白雲白，太陽出來了。')
cht['sys_nightfall'] = (u'夜幕低垂，狼群蠢蠢欲動。', u'夜深了，趕快回家吧！', u'天黑了，深夜問題多，平安回家最好！', u'夜幕低垂，月黑風高，殺人夜。')
cht['sys_killed'] = (u'<b>%s</b>陳屍家中，李組長眉頭一皺，發覺案情並不單純！', u'<b>%s</b>手握遙控器，陳屍於馬桶上！', u'<b>%s</b>被發現陳屍家中，死狀淒慘！', u'<b>%s</b>被發現陳屍家中！面露微笑。')
cht['sys_lynched'] = (u'<b>%s</b>被吊死，歹路不可行！', u'<b>%s</b>被吊死，法網恢恢，疏而不漏！')
cht['sys_deadlocked'] = u'這是一場不公平的選舉，請重新投票！'
cht['sys_dead'] = u'你已經死了！'
cht['sys_wolf_win'] = u'人狼勝利'
cht['sys_villager_win'] = u'村民勝利'

cht['role_seer'] = u'<b>%s</b>是%s'
cht['role_wolf'] = u'狼'
cht['role_villager'] = u'村民'
cht['role_heal'] = u'<b>%s</b>被你治愈了'
cht['role_block'] = u'<b>%s</b>被你迷惑，忘了他的工作。'

cht['rnd_username'] = (u'送七粒', u'哈哈波特', u'灣家阿幹', u'綠巨人浩呆', u'呻吟少女', u'每日吸', u'皮卡撐', u'蘆洲小刀', u'世貿爽哥', u'蘇澳薩克娘', u'冬瓜標', u'師父救我啊', u'衝車大將軍', u'呷麵超人', u'屌面人', u'ERO-MAN', \
u'曾豪孝', u'莊孝維', u'媽呀我不想死', u'非常親切的人', u'水車姑娘', u'褲落魔法使', u'高達八成', u'莊孝皇后', u'塞魯', u'盧塞', u'盧塞', u'肛鐵人', u'塚鬼丸', u'榴蓮終結者', u'腎堂教父', u'一個好人', \
u'詹姆士林區', u'威廉林區', u'查理士林區', u'踢牙老奶奶', u'風中蟾蜍', u'金把哺', u'幹豆腐', u'傑克鮑皮', u'斯巴達！', u'這不是肯德雞', u'雞掰仁', u'肚爛明', u'Learn2Play', u'雷克薩先生', u'對穿腸', u'潘孝威', \
u'踹共', u'臭耳聾', u'十強武者', u'阿不死鄧布利多', u'苗栗小五郎', u'廖北鴉', u'大大安安', u'咪咪冒卯', u'餵雞百科', u'炒翻天鎖螺絲', u'正義洨超人', u'消叮噹', u'金排球', u'挫咧蛋', u'阿灶伯', u'阿土伯', \
u'茱莉亞蘿蔔絲', u'里奧納多皮卡丘', u'廚神', u'銅鑼燒扛霸子', u'劉文聰', u'恰恰', u'圭蘭巴惠', u'發飆的熊', u'索索', u'軟軟', u'非濕不嗑', u'老伯迪尼諾', u'傑克尼好遜', u'不及閣大學士', u'火耗龜公', u'大腸今', \
u'加冷筍', u'小波', u'海綿體寶寶', u'迪西', u'拉拉', u'丁丁', u'妙麗割懶姐', u'蠑螈衛斯理', u'一粒蛋怒風', u'小濕妹', u'大濕兄', u'撫耳摩絲', u'名偵探科科', u'菊普去冰半', u'菊普蜜', u'烏龍綠微微', \
u'浪子蒼天有淚', u'當人小貓' \
)

cht['rnd_gamename'] = (u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'', u'')

lang['cht'] = cht